## Introduction

In [1]:
#install python using pip install pandas
#import pandas using below line
import pandas as pd

In [11]:
#pandas is a python library with help to efficiently manage data and its visualization
#pandas prefers dictionaty type of data
dict_1 = {"Car":["Maruti 800","Alto","Swift","Dzire","Ciat"],"price":[54000,50000,100000,150000,200000]}
print(dict_1.values())
print(dict_1.keys())

dict_values([['Maruti 800', 'Alto', 'Swift', 'Dzire', 'Ciat'], [54000, 50000, 100000, 150000, 200000]])
dict_keys(['Car', 'price'])

In [13]:
#let us convert into a dataframe to know what a dataframe exactly mean
car = pd.DataFrame(dict_1)
car
#isn't that amazing you can directly convert that dictionary data in to a table format, but remember the values length must be
#always same or else it will give a ValueError

          Car   price
0  Maruti 800   54000
1        Alto   50000
2       Swift  100000
3       Dzire  150000
4        Ciat  200000

## Function with Pandas 
#### ( we have to use "(..)" if it is a function/method ,else we simple use the name if it is an Attribute like(shape, columns, etc.)

In [14]:
#to read a external csv file which i have downloaded from Kaggle (https://drive.google.com/file/d/1s_lO9wT_Il9P57rXlXE-MtlE7RXSDgSw/view)
data = pd.read_csv("./titanic.csv")

In [46]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [26]:
#to print the first 5 rows
print(data.head())
#to print the last 5 rows 
print(data.tail())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [27]:
#silimar to describe the table
#here the objet data belong to the categorical data / it may be varchar (string plus number)
#at the end we also get a list which contains how many categoty of data type is present along with their count
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [28]:
# to get to know the size (No. of rows and No. of columns)
data.shape

(891, 12)

In [32]:
#if you just want all the column name
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

## performing function on the data frame

In [33]:
#gives the count of data present in Embarked column
data['Embarked'].count()

891

In [35]:
#gives the unique data with their count
data['Embarked'].value_counts()

S    645
C    169
Q     77
Name: Embarked, dtype: int64

In [37]:
#give the unique value without the count
data['Sex'].unique()

array(['male', 'female'], dtype=object)

## Accessing Rows and Columns

In [38]:
data['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [42]:
#to access multiple rows remember "[] extra"
data[['Name','Sex']]

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [45]:
#accessing rows .ilo[no. of rows, no of column].values for displaying the values
data.iloc[3,:].values

array([4, 1, 1, 'Futrelle, Mrs. Jacques Heath (Lily May Peel)', 'female',
       35.0, 1, 0, '113803', 53.1, 'C123', 'S'], dtype=object)

In [54]:
#now if we want to just have a spcific columns for specific rows
print(data.loc[0:5,['Name']])
print("------------------------*********---------------------------")
#we can also use iloc if we know the column number
print(data.iloc[0:5,3])

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry
5                                   Moran, Mr. James
------------------------*********---------------------------
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

## Filterning of Data

In [62]:
new_data = (data['Sex'] == 'female')
print(new_data)
# to get the count
new_data.value_counts()

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: Sex, Length: 891, dtype: bool

False    577
True     314
Name: Sex, dtype: int64

## Sorting of Data

In [65]:
car.sort_values('price')

          Car   price
1        Alto   50000
0  Maruti 800   54000
2       Swift  100000
3       Dzire  150000
4        Ciat  200000

## Grouping and Aggregation

In [66]:
#grouping of data along a column
groups = data.groupby(['Sex'])

In [72]:
#to get the mean
groups.mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [73]:
#to get a mean for specific column
groups.mean()['Age']

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [74]:
#or to get the count
groups.size()

Sex
female    314
male      577
dtype: int64

In [77]:
#to get the whole table of data 
groups.count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,314
male,577,577,577,577,453,577,577,577,577,107,577